code/openfoam/tutorials/XiFluid/stratified/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default             none;

    div(phi,U)          Gauss limitedLinearV 1;

    div(phi,b)          Gauss limitedLinear01 1;
    div(phiXi,Xi)       Gauss limitedLinear 1;

    div(alphaPhi,fu)    Gauss limitedLinear01 1;
    div(alphaPhi,ft)    Gauss limitedLinear01 1;
    div(alphaPhi,egr)   Gauss limitedLinear01 1;
    div(alphaPhi,h)     Gauss limitedLinear 1;
    div(alphaPhi,K)     Gauss limitedLinear 1;

    div(phi,k)          Gauss limitedLinear 1;
    div(phi,epsilon)    Gauss limitedLinear 1;

    div(rho*nuEff*dev2(T(grad(U)))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}


// ************************************************************************* //
